@extends('../layout')

@section('content')
    <svg class="big-logo" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="364.995" height="288.462" viewBox="0 0 364.995 288.462">
        <defs>
            <clipPath id="clip-path">
                <rect id="Rectangle_71" data-name="Rectangle 71" width="364.995" height="288.462" fill="none"/>
            </clipPath>
        </defs>
        <g id="Groupe_16" data-name="Groupe 16" transform="translate(0 0)">
            <path id="Tracé_75" data-name="Tracé 75" d="M82.289,59.724v42.758h32.177V56.954ZM4.985,66.3v36.182H37.162V63.563Zm41.089-3.5L59.191,80.052h1.1L75.28,60.292Z" transform="translate(11.654 133.149)" fill="#c91c22"/>
            <path id="Tracé_76" data-name="Tracé 76" d="M132.1,54.723l-8.315,34.213H122.7l-7.921-32.711L82.547,59,97.664,114.37h51.2l17.056-62.551Z" transform="translate(192.981 121.144)" fill="#c91c22"/>
            <g id="Groupe_15" data-name="Groupe 15" transform="translate(0 0)">
                <g id="Groupe_14" data-name="Groupe 14" clip-path="url(#clip-path)">
                    <path id="Tracé_77" data-name="Tracé 77" d="M171.466,50.147l-40.735,3.468c.08.965.117,2.006.117,3.044,0,18.228-12.677,29.673-29.673,29.673H80.366v-28.4L39.785,61.4v57h72.334c25.474,0,59.654-21.7,59.654-61.543,0-2.273-.113-4.509-.307-6.706m0,0-40.735,3.468c.08.965.117,2.006.117,3.044,0,18.228-12.677,29.673-29.673,29.673H80.366v-28.4L39.785,61.4v57h72.334c25.474,0,59.654-21.7,59.654-61.543,0-2.273-.113-4.509-.307-6.706" transform="translate(93.011 117.236)" fill="#c91c22"/>
                    <path id="Tracé_78" data-name="Tracé 78" d="M113.505,34.226H39.786V91.76l40.578-3.468V66.326H99.787c15.22,0,26.242,5.28,29.787,17.767l40.888-3.468c-5.971-29.1-30.945-46.4-56.957-46.4" transform="translate(93.013 80.016)" fill="#005fb8"/>
                    <path id="Tracé_79" data-name="Tracé 79" d="M61.872,34.226h84.537L124.4,44.086l15.034,4.3-39.2,5.908" transform="translate(144.645 80.015)" fill="#005fb8"/>
                    <path id="Tracé_80" data-name="Tracé 80" d="M103.295,41.709,95.868,72.317l33.979-2.937,7.56-27.671Z" transform="translate(224.123 97.509)" fill="#005fb8"/>
                    <path id="Tracé_81" data-name="Tracé 81" d="M111.376,41.709H77.23l9.6,35.147,32.4-2.8Z" transform="translate(180.55 97.509)" fill="#005fb8"/>
                    <path id="Tracé_82" data-name="Tracé 82" d="M83.889,41.744l-21.6,30.541h-1.1L39.6,41.744H6.985V95.95l32.177-2.737V87.706H40l3.872,5.107,38.185-3.271,1.4-1.836h.834v1.636L116.466,86.6V41.744Z" transform="translate(16.33 97.591)" fill="#005fb8"/>
                    <path id="Tracé_83" data-name="Tracé 83" d="M351.7,139.858C155.229,89.363,20.057,138.5,18.715,139.007L0,88.986C6.125,86.7,152.432,33.5,364.995,88.135Z" transform="translate(0 148.605)" fill="#005193"/>
                    <path id="Tracé_84" data-name="Tracé 84" d="M2.994,80.355q4.872-1.417,9.76-2.75,4.406,3.4,8.728,6.869c.107-.03.217-.057.324-.087q2.078-5.132,4.256-10.257,4.907-1.222,9.83-2.367l6.339,27.3q-4.641,1.076-9.272,2.23-1.767-7.1-3.541-14.216l-.244.06Q27.04,91.855,24.99,96.59c-.107.027-.214.053-.32.083q-4.1-3.129-8.278-6.2c-.08.023-.16.043-.24.067l3.862,14.132q-4.611,1.262-9.2,2.594Q6.906,93.811,2.994,80.355" transform="translate(6.999 167.771)" fill="#fff"/>
                    <path id="Tracé_85" data-name="Tracé 85" d="M28.86,89.689Q21.374,83.42,13.609,77.332q5.162-1.182,10.344-2.28,3.685,3.129,7.31,6.3c.1-.02.194-.04.287-.057q2.033-4.311,4.139-8.6Q40.861,71.7,46.046,70.8q-4.6,8.582-8.9,17.223l1.692,8.725q-4.091.791-8.171,1.642l-1.812-8.7" transform="translate(31.816 165.519)" fill="#fff"/>
                    <path id="Tracé_86" data-name="Tracé 86" d="M57.248,80.746c1.038,9.139-6.292,15.057-12.166,15.908Q36.7,97.84,28.359,99.267,26,85.454,23.639,71.643q8.907-1.522,17.847-2.784c7.26-1.031,14.793,3.371,15.761,11.886m-9.723,1.185c-.594-4.483-3.8-5.921-8.284-5.264q-2.328.34-4.653.7,1.011,6.524,2.019,13.054,2.433-.376,4.873-.731c3.979-.581,6.6-3.592,6.045-7.76" transform="translate(55.264 160.637)" fill="#fff"/>
                    <path id="Tracé_87" data-name="Tracé 87" d="M34.242,69.875q4.3-.486,8.6-.911l2.383,24.1q-4.131.406-8.261.875Q35.6,81.91,34.242,69.875" transform="translate(80.052 161.227)" fill="#fff"/>
                    <path id="Tracé_88" data-name="Tracé 88" d="M38.2,82.017c-.668-6.849,4.559-13.031,12.03-13.568,6.706-.481,12.277,3.331,13.478,9.319q-4.166.2-8.325.444A5.041,5.041,0,0,0,46.045,81.1a5.01,5.01,0,0,0,5.561,4.676,3.56,3.56,0,0,0,3.445-2.563c-1.312.07-2.627.15-3.942.23-.067-.945-.137-1.889-.2-2.834q6.534-.456,13.078-.764c-.007.441-.01.881-.017,1.322a12.929,12.929,0,0,1-25.761.855" transform="translate(89.181 159.927)" fill="#fff"/>
                    <path id="Tracé_89" data-name="Tracé 89" d="M46.722,68.482q4.311-.2,8.625-.33.381,12.106.758,24.209-4.151.13-8.291.314L46.722,68.482" transform="translate(109.228 159.329)" fill="#fff"/>
                    <path id="Tracé_90" data-name="Tracé 90" d="M58.657,74.6q-4.211.055-8.418.17-.085-3.239-.174-6.482,12.817-.35,25.648-.164-.05,3.239-.093,6.482-4.211-.06-8.418-.06l-.01,17.734q-4.151-.005-8.3.05-.12-8.862-.237-17.731" transform="translate(117.043 159.118)" fill="#fff"/>
                    <path id="Tracé_91" data-name="Tracé 91" d="M76.366,89.915q-4.431-.2-8.862-.327-.446,1.392-.888,2.777-4.651-.13-9.306-.187,4.236-12.056,8.805-24.052,6.609.17,13.218.487,3.675,12.3,7.013,24.637-4.646-.285-9.3-.5-.34-1.422-.684-2.837M74.8,83.357q-1.036-4.271-2.11-8.535c-.14-.007-.28-.01-.417-.017q-1.382,4.176-2.73,8.358,2.629.085,5.257.194" transform="translate(133.981 159.268)" fill="#fff"/>
                    <path id="Tracé_92" data-name="Tracé 92" d="M88.769,87.943q-.325,3.224-.651,6.452-10.785-1.086-21.6-1.782.776-12.081,1.552-24.169,4.311.28,8.618.614Q76,77.9,75.311,86.738q6.734.526,13.458,1.2" transform="translate(155.517 160.009)" fill="#fff"/>
                    <path id="Tracé_93" data-name="Tracé 93" d="M74,67.882q5.317.541,10.628,1.175,1.462,10.554,2.737,21.112l.324.04q3.9-9.893,7.974-19.737,5.3.726,10.594,1.545Q100.04,85.235,94.183,98.557q-7.59-1.071-15.2-1.949Q76.679,82.238,74,67.882" transform="translate(173.004 158.698)" fill="#fff"/>
                    <path id="Tracé_94" data-name="Tracé 94" d="M82.955,81.1c1.021-6.806,7.724-11.462,14.96-10.187,7.19,1.268,11.913,7.937,10.544,14.683a12.961,12.961,0,0,1-25.5-4.5m17.287,2.884a4.583,4.583,0,1,0-5.26,3.568,4.459,4.459,0,0,0,5.26-3.568" transform="translate(193.607 165.283)" fill="#fff"/>
                    <path id="Tracé_95" data-name="Tracé 95" d="M99.361,79.733q-4.141-.886-8.285-1.716.631-3.179,1.268-6.359,12.637,2.523,25.191,5.581-.771,3.149-1.535,6.3-4.121-1.006-8.248-1.949-1.978,8.642-3.959,17.287-4.065-.931-8.148-1.806Q97.5,88.4,99.361,79.733" transform="translate(212.92 167.527)" fill="#fff"/>
                    <path id="Tracé_96" data-name="Tracé 96" d="M110.677,81.957l-.6,2.283q7.48,1.973,14.933,4.136Q124.1,91.49,123.2,94.6q-7.37-2.143-14.78-4.092l-.611,2.323q7.38,1.943,14.72,4.075-.9,3.114-1.809,6.228-11.285-3.279-22.661-6.1,2.914-11.751,5.835-23.5,11.836,2.939,23.585,6.352-.906,3.114-1.809,6.228-7.48-2.173-14.994-4.152" transform="translate(229.248 171.899)" fill="#fff"/>
                    <path id="Tracé_97" data-name="Tracé 97" d="M95.362,132.708a21.191,21.191,0,0,1-22.13-8.788L47.9,86.3a21.136,21.136,0,0,1,5.7-29.259L132.229,4.085a21.133,21.133,0,0,1,29.259,5.708L186.826,47.41a21.136,21.136,0,0,1-5.7,29.259L102.5,129.628a20.961,20.961,0,0,1-7.133,3.081M140.944,8.087a13.741,13.741,0,0,0-4.666,2.013L57.655,63.058A13.879,13.879,0,0,0,53.913,82.25l25.337,37.621a13.878,13.878,0,0,0,19.192,3.742l78.623-52.958a13.871,13.871,0,0,0,3.742-19.193L155.47,13.845a13.727,13.727,0,0,0-8.822-5.828,13.9,13.9,0,0,0-5.7.07" transform="translate(103.592 1.17)" fill="#005fb8"/>
                    <path id="Tracé_98" data-name="Tracé 98" d="M95.362,132.708a21.191,21.191,0,0,1-22.13-8.788L47.9,86.3a21.136,21.136,0,0,1,5.7-29.259L132.229,4.085a21.133,21.133,0,0,1,29.259,5.708L186.826,47.41a21.136,21.136,0,0,1-5.7,29.259L102.5,129.628A20.961,20.961,0,0,1,95.362,132.708ZM140.944,8.087a13.741,13.741,0,0,0-4.666,2.013L57.655,63.058A13.879,13.879,0,0,0,53.913,82.25l25.337,37.621a13.878,13.878,0,0,0,19.192,3.742l78.623-52.958a13.871,13.871,0,0,0,3.742-19.193L155.47,13.845a13.727,13.727,0,0,0-8.822-5.828A13.9,13.9,0,0,0,140.944,8.087Z" transform="translate(103.592 1.17)" fill="none" stroke="#005fb8" stroke-miterlimit="10" stroke-width="1"/>
                    <path id="Tracé_99" data-name="Tracé 99" d="M111.749,67.754l-61.066-9.2,1.081-7.17,54.487,8.208L119.122,6.014l7.053,1.692Z" transform="translate(118.489 14.061)" fill="#005fb8"/>
                    <path id="Tracé_100" data-name="Tracé 100" d="M111.749,67.754l-61.066-9.2,1.081-7.17,54.487,8.208L119.122,6.014l7.053,1.692Z" transform="translate(118.489 14.061)" fill="none" stroke="#005fb8" stroke-miterlimit="10" stroke-width="1"/>
                    <rect id="Rectangle_67" data-name="Rectangle 67" width="41.115" height="7.254" transform="matrix(0.234, -0.972, 0.972, 0.234, 197.235, 114.284)" fill="#005fb8"/>
                    <rect id="Rectangle_68" data-name="Rectangle 68" width="41.115" height="7.254" transform="matrix(0.234, -0.972, 0.972, 0.234, 197.235, 114.284)" fill="none" stroke="#005fb8" stroke-miterlimit="10" stroke-width="1"/>
                    <rect id="Rectangle_69" data-name="Rectangle 69" width="7.252" height="41.113" transform="translate(230.994 64.485) rotate(-81.432)" fill="#005fb8"/>
                    <rect id="Rectangle_70" data-name="Rectangle 70" width="7.252" height="41.113" transform="translate(230.994 64.485) rotate(-81.432)" fill="none" stroke="#005fb8" stroke-miterlimit="10" stroke-width="1"/>
                </g>
            </g>
        </g>
    </svg>

    <div class="form-login form">
        <form action="{{ route('auth.authenticate') }}" method="post">
            @csrf
            <div class="form-floating form-input">
                <input placeholder="Email" class="form-control @error('email') is-invalid @enderror" id="email" value="{{ old('email') }}" type="email" name="email" required>
                <label for="email" class="form-label form-required">Email</label>
                @error('email')
                <div class="alert alert-danger">{{ $message }}</div>
                @enderror

            </div>
            <div class="form-floating form-input">
                <input placeholder="Mot de passe" class="form-control @error('password') is-invalid @enderror" id="password" type="password" name="password" required>
                <label for="password" class="form-label form-required">Mot de passe</label>
                @error('password')
                <div class="alert alert-danger">{{ $message }}</div>
                @enderror

            </div>
            <button type="submit" class="btn btn-primary btn-arrow">
                <svg xmlns="http://www.w3.org/2000/svg" width="60" height="70" viewBox="0 0 60 70">
                    <path id="Polygone_2" data-name="Polygone 2" d="M26.362,14.808a10,10,0,0,1,17.276,0l17.59,30.154A10,10,0,0,1,52.59,60H17.41A10,10,0,0,1,8.773,44.961Z" transform="translate(60) rotate(90)" fill="#fff"/>
                </svg>
            </button>
        </form>
    </div>

@endsection
